# Chapter 3
### The R environment

Which we will, of course, be going through in Python!

### Main takeaways:

`df['Column'].replace({'key_1': 'value_1', 'key_2': 'value_2'}, inplace=True)`

Lets us replace values for a column

In [6]:
import pandas as pd

Parts 3.1 to 3.4: R setup, installing packages, etc.

3.5 : Creating variables

In [10]:
metallica_names = ['Lars', 'James', 'Kirk', 'Rob']
metallica_names

['Lars', 'James', 'Kirk', 'Rob']

In [11]:
metallica_ages = [47, 47, 48, 46]
metallica_ages

[47, 47, 48, 46]

Though, of course, a better data structure would be a dictionary in this case. Let's use it to create our df:

In [15]:
metallica_df = pd.DataFrame({
    'Name': metallica_names,
    'Age': metallica_ages
})
metallica_df

    Name  Age
0   Lars   47
1  James   47
2   Kirk   48
3    Rob   46

In [16]:
metallica_df['Name']

0     Lars
1    James
2     Kirk
3      Rob
Name: Name, dtype: object

In [21]:
metallica_df['Child Age'] = [12, 12, 4, 6]

Let's view all of the variables and some summary info about them

In [23]:
metallica_df.describe(include='all')

        Name        Age  Child Age
count      4   4.000000   4.000000
unique     4        NaN        NaN
top     Lars        NaN        NaN
freq       1        NaN        NaN
mean     NaN  47.000000   8.500000
std      NaN   0.816497   4.123106
min      NaN  46.000000   4.000000
25%      NaN  46.750000   5.500000
50%      NaN  47.000000   9.000000
75%      NaN  47.250000  12.000000
max      NaN  48.000000  12.000000

In [24]:
metallica_df['Fatherhood Age'] = metallica_df['Age'] - metallica_df['Child Age']
metallica_df

    Name  Age  Child Age  Fatherhood Age
0   Lars   47         12              35
1  James   47         12              35
2   Kirk   48          4              44
3    Rob   46          6              40

#### Importing data

In [32]:
DATA_URLS = {
    'Lecturer Data': 'https://studysites.uk.sagepub.com/dsur/study/DSUR%20Data%20Files/Chapter%203/Lecturer%20Data.dat',
    'Honeymoon Period': 'https://studysites.uk.sagepub.com/dsur/study/DSUR%20Data%20Files/Chapter%203/Honeymoon%20Period.dat',
}

df_lecturer_data = pd.read_csv(DATA_URLS['Lecturer Data'], sep='\t')

In [33]:
df_lecturer_data.head()

     name  birth_date  job  friends  alcohol  income  neurotic
0     Ben    7/3/1977    1        5       10   20000        10
1  Martin   5/24/1969    1        2       15   40000        17
2    Andy   6/21/1973    1        0       20   35000        14
3    Paul   7/16/1970    1        4        5   22000        13
4  Graham  10/10/1949    1        1       30   50000        21

In [34]:
df_new_lecturer_data = df_lecturer_data[['friends', 'alcohol', 'neurotic']]
df_new_lecturer_data

   friends  alcohol  neurotic
0        5       10        10
1        2       15        17
2        0       20        14
3        4        5        13
4        1       30        21
5       10       25         7
6       12       20        13
7       15       16         9
8       12       17        14
9       17       18        13

In [35]:
df_lecturer_data['job'].replace({1: 'Lecturer', 2: 'Student'}, inplace=True)

In [36]:
df_lecturer_data

     name  birth_date       job  friends  alcohol  income  neurotic
0     Ben    7/3/1977  Lecturer        5       10   20000        10
1  Martin   5/24/1969  Lecturer        2       15   40000        17
2    Andy   6/21/1973  Lecturer        0       20   35000        14
3    Paul   7/16/1970  Lecturer        4        5   22000        13
4  Graham  10/10/1949  Lecturer        1       30   50000        21
5  Carina   11/5/1983   Student       10       25    5000         7
6  Karina   10/8/1987   Student       12       20     100        13
7    Doug   1/23/1989   Student       15       16    3000         9
8    Mark   5/20/1973   Student       12       17   10000        14
9     Zoe  11/12/1984   Student       17       18      10        13

In [37]:
df_lecturer_data[df_lecturer_data['job'] == 'Lecturer']

     name  birth_date       job  friends  alcohol  income  neurotic
0     Ben    7/3/1977  Lecturer        5       10   20000        10
1  Martin   5/24/1969  Lecturer        2       15   40000        17
2    Andy   6/21/1973  Lecturer        0       20   35000        14
3    Paul   7/16/1970  Lecturer        4        5   22000        13
4  Graham  10/10/1949  Lecturer        1       30   50000        21

Reshaping data that is in long format

In [39]:
df_satisfaction = pd.read_csv(DATA_URLS['Honeymoon Period'], sep='\t')
df_satisfaction.head()

,Person,Satisfaction_Base,Satisfaction_6_Months,Satisfaction_12_Months,Satisfaction_18_Months,Gender
0,1,6,6,5,2,0
1,2,7,7,8,4,1
2,3,4,6,2,2,1
3,4,6,9,4,1,0
4,5,6,7,6,6,0

In [44]:
pd.DataFrame(df_satisfaction.stack())

                            0
0   Person                  1
    Satisfaction_Base       6
    Satisfaction_6_Months   6
    Satisfaction_12_Months  5
    Satisfaction_18_Months  2
...                        ..
114 Satisfaction_Base       5
    Satisfaction_6_Months   6
    Satisfaction_12_Months  2
    Satisfaction_18_Months  1
    Gender                  0

[690 rows x 1 columns]

There is also `pd.cross_tab` and `pd.pivot_table` for reshaping